blog/2013-07-14-listcomprehensions.html

<!DOCTYPE HTML>
<html>
<head>
	<meta charset="utf-8">
	<title>List Comprehensions in R - Everything Counts</title>
	<meta name="author" content="Ronert Obst">

	
	<meta name="description" content="List comprehensions in Python or Haskell are popular and useful tools to filter a list given some predicates. The foreach package by Revolution &hellip;">
	
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

	<link href="/atom.xml" rel="alternate" title="Everything Counts" type="application/atom+xml">
	<link rel="canonical" href="">
	<link href="/favicon.png" rel="shortcut icon">
	<link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
	<!--[if lt IE 9]><![endif]-->
	
</head>

<body>
	<header id="header" class="inner"><h1><a href="/">Everything Counts</a></h1>
<nav id="main-nav"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</nav>
<nav id="mobile-nav">
	<div class="alignleft menu">
		<a class="button">Menu</a>
		<div class="container"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</div>
	</div>
	<div class="alignright search">
		<a class="button"></a>
		<div class="container">
			<form action="http://google.com/search" method="get">
				<input type="text" name="q" results="0">
				<input type="hidden" name="q" value="site:ronert-obst.com">
			</form>
		</div>
	</div>
</nav>
<nav id="sub-nav" class="alignright">
	<div class="social">
		
		<a class="facebook" href="http://www.facebook.com/ronert.obst" title="Facebook">Facebook</a>
		
		
		<a class="google" href="https://plus.google.com/102717496982395822694?rel=author" title="Google+">Google+</a>
		
		
		<a class="twitter" href="http://twitter.com/ronert_obst" title="Twitter">Twitter</a>
		
		
		<a class="github" href="https://github.com/ronert" title="GitHub">GitHub</a>
		
    
		
		
		
		
		
		<a class="rss" href="/atom.xml" title="RSS">RSS</a>
		
	</div>
	<form class="search" action="http://google.com/search" method="get">
		<input class="alignright" type="text" name="q" results="0">
		<input type="hidden" name="q" value="site:ronert-obst.com">
	</form>
</nav>

</header>
	
		
	
	<div id="content" class="inner"><article class="post">
	<h2 class="title">List Comprehensions in R</h2>
	<div class="entry-content"><p>
List comprehensions in Python or Haskell are popular and useful tools to filter a list given some predicates. The <code>foreach</code> package by <a href="http://www.revolutionanalytics.com/">Revolution Analytics</a> gives us a handy interface to list comprehensions in R.
</p>

<p>
Quicksort is a recursive algorithm to sort a list. In Haskell, quicksort looks very clean and elegant using list comprehensions (from <a href="http://learnyouahaskell.com/recursion#quick-sort">Learn You a Haskell for Great Good!</a>):
</p>
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #2075c7;">quicksort</span> <span style="color: #2075c7;">::</span> (<span style="color: #a57705;">Ord</span> a) <span style="color: #2075c7;">=&gt;</span> [a] <span style="color: #2075c7;">-&gt;</span> [a]  
<span style="color: #2075c7;">quicksort</span> <span style="color: #a57705;">[]</span> <span style="color: #2075c7;">=</span> <span style="color: #a57705;">[]</span>  
<span style="color: #2075c7;">quicksort</span> (x<span style="color: #a57705;">:</span>xs) <span style="color: #2075c7;">=</span>   
    <span style="color: #728a05;">let</span> smallerSorted <span style="color: #2075c7;">=</span> quicksort [a <span style="color: #2075c7;">|</span> a <span style="color: #2075c7;">&lt;-</span> xs, a <span style="color: #2075c7;">&lt;=</span> x]  
        biggerSorted <span style="color: #2075c7;">=</span> quicksort [a <span style="color: #2075c7;">|</span> a <span style="color: #2075c7;">&lt;-</span> xs, a <span style="color: #2075c7;">&gt;</span> x]  
    <span style="color: #728a05;">in</span>  smallerSorted <span style="color: #2075c7;">++</span> [x] <span style="color: #2075c7;">++</span> biggerSorted
</pre>
</div>
<p>
Quicksort takes the first element of a list and puts all smaller elements on the left of the item and all larger elements to the right. It recursively calls <code>quicksort</code> again on those sublists (<code>smallerSorted</code> and <code>biggerSorted</code>). The list comprehension <code>[a | a &lt;- xs, a &lt; x]</code>
takes a list as an input and filters out all elements that are smaller than \(x\), whereas <code>[a | a &lt;- xs, a &gt; x]</code> filters out all elements that are larger than \(x\).
</p>

<div class="org-src-container">

<pre class="src src-haskell">ghci<span style="color: #2075c7;">&gt;</span> quicksort [10,2,5,3,1,6,7,4,2,3,4,8,9]  
[1,2,2,3,3,4,4,5,6,7,8,9,10]
</pre>
</div>

<p>
Using <code>foreach</code>, the same algorithm in R looks like this (from the <code>foreach</code> <a href="http://cran.r-project.org/web/packages/foreach/vignettes/foreach.pdf">vignette</a>):
</p>

<div class="org-src-container">

<pre class="src src-r"><span style="color: #259185;">library</span>(foreach)

<span style="color: #2075c7;">qsort</span> <span style="color: #259185;">&lt;-</span> <span style="color: #728a05;">function</span>(x) {
    n <span style="color: #259185;">&lt;-</span> length(x)
    <span style="color: #728a05;">if</span> (n == 0) {
        x
    } <span style="color: #728a05;">else</span> {
        p <span style="color: #259185;">&lt;-</span> sample(n, 1)
        smaller <span style="color: #259185;">&lt;-</span> foreach(y=x[-p], .combine=c) %:% when(y &lt;= x[p]) %do% y
        larger <span style="color: #259185;">&lt;-</span> foreach(y=x[-p], .combine=c) %:% when(y &gt; x[p]) %do% y
        c(qsort(smaller), x[p], qsort(larger))
    }
}
</pre>
</div>

<p>
Not quite as concise as Haskell, but close! 
</p>

<div class="org-src-container">

<pre class="src src-r">&gt; qsort(c(10,2,5,3,1,6,7,4,2,3,4,8,9))
[1]  1  2  2  3  3  4  4  5  6  7  8  9 10
</pre>
</div>
</div>


<div class="meta">
	<div class="date">








  


<time datetime="2013-07-14T00:00:00+02:00" pubdate data-updated="true">Jul 14<span>th</span>, 2013</time></div>
	<div class="tags">


	<a class='category' href='/blog/categories/r/'>R</a>


</div>
	
</div></article>

	<div class="share">
	<div class="addthis_toolbox addthis_default_style ">
	
	<a class="addthis_button_facebook_like" fb:like:layout="button_count"></a>
	
	
	<a class="addthis_button_tweet"></a>
	
	
	<a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
	
	<a class="addthis_counter addthis_pill_style"></a>
	</div>
  <script type="text/javascript" src="http://s7.addthis.com/js/250/addthis_widget.js#pubid="></script>
</div>


</div>
	<footer id="footer" class="inner">Copyright &copy; 2013

    Ronert Obst

– Proud member of <a href="http://www.r-bloggers.com">www.r-bloggers.com</a>
</footer>
	<script src="/javascripts/slash.js"></script>
<script src="/javascripts/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
	$('.fancybox').fancybox();
})(jQuery);
</script> <!-- Delete or comment this line to disable Fancybox -->


<script type="text/javascript">
      var disqus_shortname = 'everythingcounts';
      
        
        var disqus_script = 'count.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>



	<script type="text/javascript">
		var _gaq = _gaq || [];
		_gaq.push(['_setAccount', 'UA-40781735-1']);
		_gaq.push(['_trackPageview']);

		(function() {
			var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
			ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
			var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
		})();
	</script>



</body>
</html>